// Спроєктувати класи для представлення бінарного дерева, елементами
// якого є символи рядка. Реалізувати необхідні конструктори, метод
// виведення дерева, інші методи для виконання поставленого завдання.
// Визначити усі термінальні вершини (листя) цього дерева і термінальну
// вершину з найбільшим кодом символа. Програма повинна забезпечувати 
// наочне виведення усіх вхідних, вихідних та проміжних даних, а також 
// контроль можливих помилок. Для обробки помилок (у тому числі і не 
// коректного введення даних) використати виключні ситуації.

#include "functions.h"
using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	string str;
	cout << "Введіть рядок символів: ";
	cin >> str;
	BinaryTree Tree(str);

	cout << "\nУтворене бінарне дерево:\n\n";
	Tree.printTree();

	int n = size(str),
		m = n - pow(2, log2l(n)) + 1;
	m = m + ceil(pow(2, log2l(n) - 1)) - (m + 1) / 2;
	cout << "\n\nКількість термінальних вершин (листків): " << m;

	cout << "\n\nПерелік термінальних вершин:\n\n";
	char maxSymb = Tree.findLeafs();
	cout << "\nНайбільше значення термінальної вершини: " << maxSymb << "\n\n";

	Tree.clearMemory();

	system("pause");
	return 0;
}
