// Спроєктувати класи для представлення двійкового дерева пошуку, елементами якого є літери заданого рядка.
// Реалізувати необхідні конструктори, метод виведення дерева, інші методи для виконання поставленого завдання. 
// Із побудованого дерева видалити літери, що зустрічаються більше одного разу. Вивести елементи дерева, що
// залишилися, при його постфіксному обході.
// Програма повинна забезпечувати наочне виведення усіх вхідних, вихідних та проміжних даних, а також контроль 
// можливих помилок. Для обробки помилок (у тому числі не коректного введення даних) використати виключні ситуації.

#include "functions.h"
using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	string str;
	cout << "Введіть рядок: "; cin >> str;
	BinarySearchTree Tree(str);

	cout << "\n\nУведене вами дерево:\n\n";
	Tree.printTree();
	cout << "\n\n";

	Tree.clearMemory();

	system("pause");
	return 0;
}
