// Спроектувати класи для представлення бінарного дерева пошуку, елементами якого є цілі числа. 
// Реалізувати необхідні конструктори, метод виведення дерева, інші методи для виконання поставленого 
// завдання. Визначити кількість вузлових вершин (не листків) даного дерева та надрукувати їх координати 
// (номер рівня та номер гілки). Програма повинна забезпечувати наочне виведення усіх вхідних, вихідних 
// та проміжних даних, а також контроль можливих помилок. Для обробки помилок (у тому числі не коректного 
// введення даних) використати виключні ситуації.

#include "functions.h"
using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	BinaryTree Tree = createTree();
	cout << "\nВведене вами дерево:\n\n";
	Tree.printTree();

	cout << "\nСписок координат вузлових вершин:\n\n";
	int numOfNodes = findNodes(Tree.Root);
	cout << "\nКількість вузлових вершин (не листків) даного дерева: " << numOfNodes << "\n\n";
	Tree.clearMemory();

	system("pause");
	return 0;
}
