// Спроєктувати класи для представлення бінарного дерева пошуку, елементами якого є цілі числа. Реалізувати 
// необхідні конструктори, метод виведення дерева, інші методи для виконання поставленого завдання. Визначити 
// кількість вузлових вершин (не листків) даного дерева та надрукувати їх координати (номер рівня та номер гілки).
// Програма повинна забезпечувати наочне виведення усіх вхідних, вихідних та проміжних даних, а також контроль 
// можливих помилок. Для обробки помилок (у тому числі не коректного введення даних) використати виключні ситуації.

// 20:24

#include "functions.h"
using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	int n = inputCountOfNums();
	int* arr = inputNums(n);

	cout << "\nВведена вами послідовність: ";
	outputArr(arr, n);

	BinarySearchTree Tree(arr, n);
	cout << "\nУтворене дерево:\n\n";
	Tree.printTree();

// 20:46

	cout << "\n\nКількість вузлових вершин дерева: " << Tree.countNodes() << "\n\n";
	Tree.printNodeCoordinates();
	cout << "\n\n";

// 21:08

	Tree.clearMemory();

	system("pause");
	return 0;
}
