// Спроєктувати класи для представлення двійкового дерева пошуку, в вершинах якого знаходяться цілі числа. 
// Реалізувати необхідні конструктори, метод виведення дерева, інші методи для виконання поставленого завдання. 
// Визначити чи є дерево збалансованим.
// Програма повинна забезпечувати наочне виведення усіх вхідних, вихідних та проміжних даних, а також контроль 
// можливих помилок. Для обробки помилок (у тому числі не коректного введення даних) використати виключні ситуації.

#include "functions.h"
using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	int n = inputNumOfElem();
	int* nums = inputArray(n);

	BinarySearchTree Tree(nums, n);
	delete[] nums;

	cout << "\nВведене вами дерево:\n\n";
	Tree.printTree();
	cout << "\n\n";
	Tree.clearMemory();

	system("pause");
	return 0;
}
