// Спроєктувати класи для представлення бінарного дерева, елементами
// якого є дійсні числа. Реалізувати необхідні конструктори, метод
// виведення дерева, інші методи для виконання поставленого завдання.
// Вивести термінальні вершини (листя) цього дерева у порядку зростання 
// їх значень, а також середнє арифметичне значення цих вершин.
// Програма повинна забезпечувати наочне виведення усіх вхідних, вихідних
// та проміжних даних, а також контроль можливих помилок. Для обробки помилок
// (у тому числі і не коректного введення даних) використати виключні ситуації.

#include "functions.h"
using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	int n = 0;
	double* nums = inputNums(n);

	BinaryTree Tree;
	Tree = BinaryTree::createTree(nums, 0, n);

	cout << "\nВведене вами дерево:\n\n";
	Tree.printTree();
	cout << "\n";

	Tree.clearMemory();
	delete[] nums;

	system("pause");
	return 0;
}
